{"keras_version": "2.2.4", "class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 100], "dtype": "float32", "name": "input_1", "sparse": false}, "name": "input_1"}, {"inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 3], "dtype": "float32", "name": "input_2", "sparse": false}, "name": "input_2"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "LSTM", "config": {"trainable": true, "stateful": false, "dropout": 0.0, "batch_input_shape": [null, 1, 100], "kernel_constraint": null, "return_sequences": false, "use_bias": true, "recurrent_activation": "hard_sigmoid", "unroll": false, "name": "lstm_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "implementation": 1, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_state": false, "activation": "tanh", "bias_constraint": null, "activity_regularizer": null, "units": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "dtype": "float32", "kernel_regularizer": null, "recurrent_constraint": null, "bias_regularizer": null, "go_backwards": false}, "name": "lstm_1"}, {"inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "Dense", "config": {"trainable": true, "activation": "linear", "bias_constraint": null, "activity_regularizer": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "batch_input_shape": [null, 3], "kernel_constraint": null, "use_bias": true, "dtype": "float32", "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null}, "name": "dense_1"}, {"inbound_nodes": [[["lstm_1", 0, 0, {}], ["dense_1", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_1", "axis": 1}, "name": "concatenate_1"}, {"inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Dense", "config": {"trainable": true, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "units": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": null, "use_bias": true, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null}, "name": "dense_2"}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "name": "model_1", "output_layers": [["dense_2", 0, 0]]}, "backend": "tensorflow"}